artillery-test-sample.yaml
config:
  target: "https://the-one-api.dev/v2"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Warm up"
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: "Ramp up load"
#    - duration: 600
#      arrivalRate: 50
#      name: "Sustained load"
  plugins:
    vsts: {}
scenarios:
  - flow:
      - get:
          url: "/book"
      - get:
          url: "/movie"
      - get:
          url: "/character"